<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<% 
	//자바 코드를 실행 시키는 2가지 방법
	// 1)app : Class -> main() -> 코드구현 -> os상에 호출
	// 주석 기입 히스토리 추적할수있다
	// 완벽하게 하려고 하지말고 계속해볼것
	// 2) webapp : jsp -> <% ...- > 코드구현 -> 호출을 하기위한 클라이언트가있어야함 브라우저 주소창 호출, A태그 , 폼태그 액션을 이용하여

	// 값 : 숫자(실수일때는 약간의 오차가존재),논리값(true,false),문자값(문자열이아닌 문자1개)
	// CPU는 연산장치
	
	// 참조타입 (기본타입이아닌 모든것)
	// ex) String s ; 
	// S = "abc" 메모리에는 한글자만들어갈수있어 다른곳에 만든후 참조값(그냥위치값이라고 생각)을 메모리에 저장
	
%>
